{
    "Download and process the files in which contains three files with different encodings: data1.csv: CSV file encoded in CP-1252 data2.csv: CSV file encoded in UTF-8 data3.txt": "ga1_q12",
    "Write a web application that exposes an API with a single query parameter: ?country=. It should fetch the Wikipedia page of the country, extracts all headings (H1 to H6), and create a Markdown outline for the country. The outline should look like this:             ## Contents            # Vanuatu            ## Etymology            ## History            ### Prehistory            ...           API Development: Choose any web framework (e.g., FastAPI) to develop the web application. Create an API endpoint (e.g., /api/outline) that accepts a country query parameter.           Fetching Wikipedia Content: Find out the Wikipedia URL of the country and fetch the page's HTML.           Extracting Headings: Use an HTML parsing library (e.g., BeautifulSoup, lxml) to parse the fetched Wikipedia page. Extract all headings (H1 to H6) from the page, maintaining order.           Generating Markdown Outline: Convert the extracted headings into a Markdown-formatted outline. Headings should begin with #.           Enabling CORS: Configure the web application to include appropriate CORS headers, allowing GET requests from any origin.":"ga4_q4",
    "Your Task      Source: Utilize IMDb's advanced web search at https://www.imdb.com/search/title/ to access movie data.      Filter: Filter all titles with a rating between 5 and 7.      Format: For up to the first 25 titles, extract the necessary details: ID, title, year, and rating. The ID of the movie is the part of the URL after tt in the href attribute. For example, tt10078772. Organize the data into a JSON structure as follows:      [       { 'id': 'tt1234567', 'title': 'Movie 1', 'year': '2021', 'rating': '5.8' },       { 'id': 'tt7654321', 'title': 'Movie 2', 'year': '2019', 'rating': '6.2' },       // ... more titles      ]      Submit: Submit the JSON data in the text box below.":"ga4_q2"
}